cases/base/elbow_20d_refine/system/createPatchDict
patches
(
    // Sección antes del codo
    {
        name    midIn;
        patchInfo
        {
            type    patch;
        }
        faces
        (
            (  <LISTA DE FACES AUTOGENERABLE> )
        );
    }

    // Sección después del codo
    {
        name    midOut;
        patchInfo
        {
            type    patch;
        }
        faces
        (
            (  <LISTA DE FACES AUTOGENERABLE> )
        );
    }
);

