cases/base/elbow_20d_refine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          483;
        startFace       1170802;
    }
    outlet
    {
        type            patch;
        nFaces          451;
        startFace       1171285;
    }
    wall
    {
        type            wall;
        nFaces          34098;
        startFace       1171736;
    }
)

// ************************************************************************* //
