cases/base/elbow_20d_refine/system/mapFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mapFieldsDict;
}

patchMap
(
    inlet   outlet
);

cuttingPatches ();
